@pacrutchet Status update: The API bug has been fixed on FOS 7.0.0. Validation:

**Step1: create fortios_router_accesslist resource with exact_match = disable**
```
labfirewall # get system status
Version: FortiGate-VM64 v7.0.0,build0066,210330 (GA)
```

```hcl
provider "fortios" {
  hostname = "192.168.52.177"
  insecure = "true"
  token    = "GNH7r40H65GNb46kd4rG8rtrmn0fr1"
}

resource "fortios_router_accesslist" "static_ospf_redistribution_networks" {
  name     = "static-redistribution"
  comments = "Used to specify networks which get redistributed into OSPF"

  rule {
    id          = 10
    action      = "permit"
    prefix      = "10.0.0.0 255.0.0.0"
    exact_match = "disable"
  }
}
```

```
# terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # fortios_router_accesslist.static_ospf_redistribution_networks will be created
  + resource "fortios_router_accesslist" "static_ospf_redistribution_networks" {
      + comments              = "Used to specify networks which get redistributed into OSPF"
      + dynamic_sort_subtable = "false"
      + id                    = (known after apply)
      + name                  = "static-redistribution"

      + rule {
          + action      = "permit"
          + exact_match = "disable"
          + flags       = (known after apply)
          + id          = 10
          + prefix      = "10.0.0.0 255.0.0.0"
          + wildcard    = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

fortios_router_accesslist.static_ospf_redistribution_networks: Creating...
fortios_router_accesslist.static_ospf_redistribution_networks: Creation complete after 0s [id=static-redistribution]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```
```
labfirewall # config router access-list

labfirewall (access-list) # show
config router access-list
    edit "static-redistribution"
        set comments "Used to specify networks which get redistributed into OSPF"
        config rule
            edit 10
                set prefix 10.0.0.0 255.0.0.0
            next
        end
    next
end
```

**Step2 Set exact_match = enable**
```hcl
resource "fortios_router_accesslist" "static_ospf_redistribution_networks" {
  name     = "static-redistribution"
  comments = "Used to specify networks which get redistributed into OSPF"

  rule {
    id          = 10
    action      = "permit"
    prefix      = "10.0.0.0 255.0.0.0"
    exact_match = "enable"
  }
}
```
```
# terraform apply
fortios_router_accesslist.static_ospf_redistribution_networks: Refreshing state... [id=static-redistribution]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # fortios_router_accesslist.static_ospf_redistribution_networks will be updated in-place
  ~ resource "fortios_router_accesslist" "static_ospf_redistribution_networks" {
        comments              = "Used to specify networks which get redistributed into OSPF"
        dynamic_sort_subtable = "false"
        id                    = "static-redistribution"
        name                  = "static-redistribution"

      ~ rule {
            action      = "permit"
          ~ exact_match = "disable" -> "enable"
            flags       = 0
            id          = 10
            prefix      = "10.0.0.0 255.0.0.0"
        }
    }

Plan: 0 to add, 1 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

fortios_router_accesslist.static_ospf_redistribution_networks: Modifying... [id=static-redistribution]
fortios_router_accesslist.static_ospf_redistribution_networks: Modifications complete after 0s [id=static-redistribution]

Apply complete! Resources: 0 added, 1 changed, 0 destroyed.
```
```
labfirewall (access-list) # show
config router access-list
    edit "static-redistribution"
        set comments "Used to specify networks which get redistributed into OSPF"
        config rule
            edit 10
                set prefix 10.0.0.0 255.0.0.0
                set exact-match enable
            next
        end
    next
end
```
BTW https://github.com/fortinetdev/terraform-provider-fortios/issues/99#issuecomment-712997264 "Option I: Update to FortiOS 6.4.2, the FortiAPI bug has been fixed on FortiOS 6.4.2."  The judgment is wrong, please ignore it. 

Thank you @pacrutchet !










